Repository: Min6662/edu-solution-docs
Catalog: lib/l10n/app_*.arb
Languages: km

# appTitle
source: Edu Solution
km: ដំណោះស្រាយអប់រំ

source: Login
km: ចូលប្រវើប្រាស់

source: Email
km: អុីមែល

source: Password
km: ពាក្យសម្ងាត់

# loginButton
source: Login
km: ចូល

source: Login failed
km: ការចូលបានបរាជ័យ

# welcomeMessage
source: Welcome to Edu Solution
km: សូមស្វាគមន៍មកកាន់ Edu Solution

source: Sign in to continue
km: សូមចូលដើម្បីបន្ត

source: Forgot Password?
km: ភ្លេចពាក្យសម្ងាត់?

# enterEmail
source: Enter your email
km: បញ្ចូលអុីមែលរបស់អ្នក

# enterPassword
source: Enter your password
km: បញ្ចូលពាក្យសម្ងាត់របស់អ្នក

# passwordHint
source: Enter your password
km: បញ្ចូលពាក្យសម្ងាត់របស់អ្នក

# loginSuccess
source: Login successful
km: ការចូលជោគជ័យ

# invalidCredentials
source: Invalid email or password
km: អុីមែល ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ

# networkError
source: Network error. Please try again.
km: បញ្ហាបណ្តាញ។ សូមព្យាយាមម្តងទៀត។

source: Language
km: ភាសា

source: Select Language
km: ជ្រើសរើសភាសា

source: Settings
km: ការកំណត់

source: Edit Profile
km: កែប្រែព័ត៌មានផ្ទាល់ខ្លួន

# updatePersonalInfo
source: Update your personal information
km: ធ្វើបច្ចុប្បន្នភាពព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នក

source: Change Password
km: ផ្លាស់ប្តូរពាក្យសម្ងាត់

# updatePassword
source: Update your account password
km: ធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់គណនីរបស់អ្នក

source: Students
km: សិស្ស

# viewManageStudents
source: View and manage students
km: មើល និងគ្រប់គ្រងសិស្ស

source: Manage Teacher
km: គ្រប់គ្រងគ្រូ

# addEditRemoveTeachers
source: Add, edit, or remove teachers
km: បន្ថែម កែប្រែ ឬដកគ្រូចេញ

source: School Management
km: ការគ្រប់គ្រងសាលារៀន

source: Configure school settings
km: កំណត់ការកំណត់សាលារៀន

source: Change app language
km: ផ្លាស់ប្តូរភាសាកម្មវិធី

source: Logout
km: ចេញពីប្រព័ន្ធ

# signOutAccount
source: Sign out of your account
km: ចេញពីគណនីរបស់អ្នក

source: Cancel
km: បោះបង់

source: No user found.
km: រកមិនឃើញអ្នកប្រើប្រាស់។

source: Dashboard
km: ផ្ទាំងគ្រប់គ្រង

# classCard
source: Class
km: ថ្នាក់

source: View all classes
km: មើលថ្នាក់ទាំងអស់

source: Student
km: សិស្ស

source: View all students
km: មើលសិស្សទាំងអស់

source: Exam Result
km: លទ្ធផលប្រលង

source: View exam results
km: មើលលទ្ធផលប្រលង

source: QR Scan
km: ស្កេន QR

source: Smart Attendance
km: វត្តមានឆ្លាតវៃ

source: Attendance
km: វត្តមាន

source: For Students
km: សម្រាប់សិស្ស

source: Scan History
km: ប្រវត្តិស្កេន

source: Attendance Records
km: កំណត់ត្រាវត្តមាន

source: Scan Record
km: កំណត់ត្រាស្កេន

source: Staff Attendance
km: វត្តមានបុគ្គលិក

source: Schedule
km: កាលវិភាគ

source: Check & Manage
km: ពិនិត្យ និងគ្រប់គ្រង

source: Timetable
km: តារាងពេលវេលា

source: No teachers found.
km: រកមិនឃើញគ្រូ។

source: Subject:
km: មុខវិជ្ជា:

source: Gender
km: ភេទ

source: Experience
km: បទពិសោធន៍

source: years
km: ឆ្នាំ

source: Tap to view details
km: ចុចដើម្បីមើលព័ត៌មានលម្អិត

source: Home
km: ទំព័រដើម

source: Results
km: លទ្ធផល

source: Add Student
km: បន្ថែមសិស្ស

source: Name
km: ឈ្មោះ

source: Grade
km: ថ្នាក់

source: Address
km: អាសយដ្ឋាន

source: Phone Number
km: លេខទូរស័ព្ទ

source: Study Status
km: ស្ថានភាពសិក្សា

# motherName
source: Mother's Name
km: ឈ្មោះម្តាយ

# fatherName
source: Father's Name
km: ឈ្មោះឪពុក

source: Place of Birth
km: ទីកន្លែងកំណើត

source: Date of Birth
km: ថ្ងៃខែឆ្នាំកំណើត

source: Save
km: រក្សាទុក

source: Failed to add student
km: បរាជ័យក្នុងការបន្ថែមសិស្ស

source: Unknown error
km: កំហុសមិនស្គាល់

source: Student added successfully
km: បន្ថែមសិស្សបានជោគជ័យ

source: Class Schedule
km: កាលវិភាគថ្នាក់រៀន

source: Teacher
km: គ្រូ

# classLabel
source: Class:
km: ថ្នាក់:

source: Select teacher
km: ជ្រើសរើសគ្រូ

source: Select Class
km: ជ្រើសរើសថ្នាក់

source: Teacher Schedule
km: កាលវិភាគគ្រូ

source: VIEW ONLY MODE
km: របៀបមើលប៉ុណ្ណោះ

# morningSchedule
source: MORNING SCHEDULE (7:00 AM - 12:00 PM)
km: កាលវិភាគព្រឹក (ម៉ោង 7:00 ព្រឹក - 12:00 ថ្ងៃ)

# afternoonSchedule
source: AFTERNOON SCHEDULE (1:00 PM - 5:00 PM)
km: កាលវិភាគរសៀល (ម៉ោង 1:00 រសៀល - 5:00 ល្ងាច)

source: Time:
km: ពេលវេលា:

source: Mon
km: ច័ន្ទ

source: Tue
km: អង្គារ

source: Wed
km: ពុធ

source: Thu
km: ព្រហស្បតិ៍

source: Fri
km: សុក្រ

source: VIEW ONLY
km: មើលប៉ុណ្ណោះ

source: OTHER TEACHER
km: គ្រូផ្សេង

source: Current Assignment:
km: កិច្ចការបច្ចុប្បន្ន:

# editWillOverwrite
source: Edit will overwrite the current assignment:
km: ការកែប្រែនឹងសរសេរជាន់លើកិច្ចការបច្ចុប្បន្ន:

source: Enter subject name
km: បញ្ចូលឈ្មោះមុខវិជ្ជា

# enterSubjectForClass
source: Enter subject name for selected class
km: បញ្ចូលឈ្មោះមុខវិជ្ជាសម្រាប់ថ្នាក់ដែលបានជ្រើសរើស

# assignedToClass
source: This will be assigned to the selected class
km: នេះនឹងត្រូវបានចាត់តាំងទៅថ្នាក់ដែលបានជ្រើសរើស

source: Close
km: បិទ

source: Overwrite
km: សរសេរជាន់លើ

source: Delete
km: លុប

# selectBothTeacherClass
source: Please select both teacher and class
km: សូមជ្រើសរើសទាំងគ្រូ និងថ្នាក់

# errorLoadingSchedule
source: Error loading schedule data
km: កំហុសក្នុងការផ្ទុកទិន្នន័យកាលវិភាគ

source: Schedule View Only
km: មើលកាលវិភាគប៉ុណ្ណោះ

# assignedTeachingSchedule
source: This is your assigned teaching schedule. Click any cell to view details.
km: នេះជាកាលវិភាគបង្រៀនដែលបានចាត់តាំងរបស់អ្នក។ ចុចលើក្រឡាណាមួយដើម្បីមើលព័ត៌មានលម្អិត។

source: Clear Schedule
km: សម្អាតកាលវិភាគ

source: Save Schedule
km: រក្សាទុកកាលវិភាគ

# clearScheduleConfirm
source: Are you sure you want to clear the entire schedule?
km: តើអ្នកប្រាកដថាចង់សម្អាតកាលវិភាគទាំងមូលទេ?

# scheduleCleared
source: Schedule cleared successfully
km: សម្អាតកាលវិភាគបានជោគជ័យ

# scheduleSaved
source: Schedule saved successfully
km: រក្សាទុកកាលវិភាគបានជោគជ័យ

# scheduleSavedSuccess
source: Schedule saved successfully
km: រក្សាទុកកាលវិភាគបានជោគជ័យ

source: Exam Results
km: លទ្ធផលប្រលង

# viewManageExamResults
source: View and manage exam results for all students and classes
km: មើល និងគ្រប់គ្រងលទ្ធផលប្រលង សម្រាប់សិស្ស និងថ្នាក់រៀនទាំងអស់

source: View Results
km: មើលលទ្ធផល

source: Exam Result feature coming soon!
km: មុខងារលទ្ធផលប្រលងនឹងមកដល់ឆាប់ៗនេះ!

# teacherDetails
source: Details
km: ព័ត៌មានលម្អិត

source: Delete Teacher
km: លុបគ្រូ

source: Basic Information
km: ព័ត៌មានមូលដ្ឋាន

source: Edit
km: កែប្រែ

source: Full Name
km: ឈ្មោះពេញ

# yearsOfExperience
source: years of study
km: ឆ្នាំសិក្សា

source: Hourly Pay ($)
km: ប្រាក់ឈ្នួលក្នុងមួយម៉ោង ($)

source: Not specified
km: មិនបានបញ្ជាក់

source: hr
km: ម៉ោង

source: Save Changes
km: រក្សាទុកការផ្លាស់ប្តូរ

source: Login Credentials
km: ព័ត៌មានចូលប្រើ

source: Username
km: ឈ្មោះអ្នកប្រើ

source: Account Status
km: ស្ថានភាពគណនី

source: Active
km: សកម្មភាព

source: Inactive
km: មិនសកម្ម

source: Not available
km: មិនមាន

# noAccountCreated
source: No account created yet
km: មិនទាន់បង្កើតគណនី

source: Change Username
km: ផ្លាស់ប្តូរឈ្មោះអ្នកប្រើ

source: Copy Credentials
km: ចម្លងព័ត៌មានចូលប្រើ

source: Set Credentials
km: កំណត់ព័ត៌មានចូលប្រើ

source: Update Photo
km: ធ្វើបច្ចុប្បន្នភាពរូបថត

source: Tap to Add
km: ចុចដើម្បីបន្ថែម

source: Photo
km: រូបថត

source: Danger Zone
km: តំបន់ការពារ

# deleteTeacherWarning
source: Deleting this teacher will permanently remove all their data, including login credentials and schedule assignments.
km: ការលុបគ្រូនេះនឹងលុបទិន្នន័យទាំងអស់របស់គាត់ជាអចិន្ត្រៃយ៍ រួមទាំងព័ត៌មានចូលប្រើ និងការកំណត់កាលវិភាគ។

source: Saving changes...
km: កំពុងរក្សាទុកការផ្លាស់ប្តូរ...

# fullNameRequired
source: Full name is required
km: ឈ្មោះពេញត្រូវបានទាមទារ

# teacherInfoUpdated
source: Teacher information updated successfully!
km: ព័ត៌មានគ្រូត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ!

source: Failed to save changes
km: បរាជ័យក្នុងការរក្សាទុកការផ្លាស់ប្តូរ

source: Setting credentials...
km: កំពុងកំណត់ព័ត៌មានចូលប្រើ...

source: Credentials Set Successfully
km: កំណត់ព័ត៌មានចូលប្រើបានជោគជ័យ

# shareCredentialsSecurely
source: Please share these credentials securely with the teacher.
km: សូមចែករំលែកព័ត៌មានចូលប្រើទាំងនេះប្រកបដោយសុវត្ថិភាពជាមួយគ្រូ។

source: Done
km: រួចរាល់

source: Create login credentials
km: បង្កើតព័ត៌មានចូលប្រើ

source: Generate new suggestion
km: បង្កើតជម្រើសថ្មី

# tipGenerateUsername
source: Tip: Click the refresh icon to generate a new username suggestion
km: ជំនួយ៖ ចុចនៅលើរូបតំណាងធ្វើឡើងវិញដើម្បីបង្កើតជម្រើសឈ្មោះអ្នកប្រើថ្មី

source: Generate password
km: បង្កើតពាក្យសម្ងាត់

# createUserAccountWarning
source: This will create a new user account for the teacher. If username exists, please try a different one.
km: នេះនឹងបង្កើតគណនីអ្នកប្រើថ្មីសម្រាប់គ្រូ។ ប្រសិនបើឈ្មោះអ្នកប្រើមានហើយ សូមព្យាយាមប្រើឈ្មោះផ្សេង។

source: New Password
km: ពាក្យសម្ងាត់ថ្មី

source: Confirm Password
km: បញ្ជាក់ពាក្យសម្ងាត់

source: Passwords do not match
km: ពាក្យសម្ងាត់មិនត្រូវគ្នាទេ

# updateTeacherPassword
source: This will update the teacher's login password.
km: នេះនឹងធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់ចូលប្រើរបស់គ្រូ។

source: New Username
km: ឈ្មោះអ្នកប្រើថ្មី

# enterDifferentUsername
source: Please enter a different username
km: សូមបញ្ចូលឈ្មោះអ្នកប្រើផ្សេង

# updateTeacherUsername
source: This will update the teacher's login username.
km: នេះនឹងធ្វើបច្ចុប្បន្នភាពឈ្មោះអ្នកប្រើចូលប្រើរបស់គ្រូ។

source: Current login credentials
km: ព័ត៌មានចូលប្រើបច្ចុប្បន្ន

source: Both
km: ទាំងពីរ

source: Updating password...
km: កំពុងធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់...

# passwordUpdated
source: Password updated in Teacher record. Note: User account requires recreation for login.
km: ពាក្យសម្ងាត់ត្រូវបានធ្វើបច្ចុប្បន្នភាពក្នុងកំណត់ត្រាគ្រូ។ ចំណាំ៖ គណនីអ្នកប្រើត្រូវការបង្កើតឡើងវិញសម្រាប់ការចូលប្រើ។

source: Failed to update password
km: បរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់

source: Updating username...
km: កំពុងធ្វើបច្ចុប្បន្នភាពឈ្មោះអ្នកប្រើ...

# usernameUpdated
source: Username updated in Teacher record. Note: User account requires recreation for login.
km: ឈ្មោះអ្នកប្រើត្រូវបានធ្វើបច្ចុប្បន្នភាពក្នុងកំណត់ត្រាគ្រូ។ ចំណាំ៖ គណនីអ្នកប្រើត្រូវការបង្កើតឡើងវិញសម្រាប់ការចូលប្រើ។

source: Failed to update username
km: បរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពឈ្មោះអ្នកប្រើ

source: Recreate Account
km: បង្កើតគណនីឡើងវិញ

# recreateAccountWarning
source: This will DELETE the existing account and create a new one.
km: នេះនឹងលុបគណនីដែលមានស្រាប់ ហើយបង្កើតគណនីថ្មី។

source: Create new account
km: បង្កើតគណនីថ្មី

# accountRecreated
source: Account recreated successfully! Teacher can now login with new credentials.
km: បង្កើតគណនីឡើងវិញបានជោគជ័យ! គ្រូអាចចូលប្រើដោយប្រើព័ត៌មានចូលប្រើថ្មី។

source: Failed to recreate account
km: បរាជ័យក្នុងការបង្កើតគណនីឡើងវិញ

source: Update Teacher Photo
km: ធ្វើបច្ចុប្បន្នភាពរូបថតគ្រូ

source: Photo URL
km: URL រូបថត

# enterPhotoURL
source: Enter a direct link to the teacher's photo. The photo should be publicly accessible.
km: បញ្ចូលតំណភ្ជាប់ដោយផ្ទាល់ទៅកាន់រូបថតរបស់គ្រូ។ រូបថតគួរតែអាចចូលដំណើរការជាសាធារណៈបាន។

# enterValidURL
source: Please enter a valid URL
km: សូមបញ្ចូល URL ត្រឹមត្រូវ

source: Updating photo...
km: កំពុងធ្វើបច្ចុប្បន្នភាពរូបថត...

# photoUpdated
source: Photo updated successfully! Please refresh to see changes.
km: រូបថតត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ! សូមធ្វើឲ្យស្រស់ដើម្បីមើលការផ្លាស់ប្តូរ។

source: Failed to update photo
km: បរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពរូបថត

# choosePhotoUpdate
source: Choose how to update photo
km: ជ្រើសរើសវិធីធ្វើបច្ចុប្បន្នភាពរូបថត

source: Camera
km: ម៉ាស៊ីនថត

source: Gallery
km: វិចិត្រសាល

source: Enter URL Instead
km: បញ្ចូល URL ជំនួសវិញ

source: Failed to take photo
km: បរាជ័យក្នុងការថតរូប

source: Failed to select photo
km: បរាជ័យក្នុងការជ្រើសរើសរូបថត

source: Uploading photo...
km: កំពុងផ្ទុកឡើងរូបថត...

source: Failed to upload photo
km: បរាជ័យក្នុងការផ្ទុកឡើងរូបថត

# deleteTeacherConfirm
source: Are you sure you want to delete
km: តើអ្នកប្រាកដថាចង់លុប

# actionWillRemove
source: This action will permanently remove:
km: សកម្មភាពនេះនឹងលុបជាអចិន្ត្រៃយ៍៖

# teacherProfile
source: • Teacher profile and information
km: • ប្រវត្តិរូប និងព័ត៌មានគ្រូ

# loginCredentialsData
source: • Login credentials
km: • ព័ត៌មានចូលប្រើ

source: • Schedule assignments
km: • ការកំណត់កាលវិភាគ

source: • All associated data
km: • ទិន្នន័យដែលពាក់ព័ន្ធទាំងអស់

# actionCannotBeUndone
source: This action cannot be undone!
km: សកម្មភាពនេះមិនអាចត្រូវបានអាណ្ណូតិទេ!

source: Deleting teacher...
km: កំពុងលុបគ្រូ...

source: Teacher deleted successfully
km: លុបគ្រូបានជោគជ័យ

source: Failed to delete teacher
km: បរាជ័យក្នុងការលុបគ្រូ

source: Search and Find Students
km: ស្វែងរក និងរកសិស្ស

source: Refresh
km: ធ្វើឱ្យស្រស់

source: Search
km: ស្វែងរក

source: Student Of Assalam
km: សិស្សនៃអាសាឡាម

source: Failed to load cached students
km: បរាជ័យក្នុងការផ្ទុកសិស្សដែលបានរក្សាទុក

source: Error loading students
km: កំហុសក្នុងការផ្ទុកសិស្ស

source: Error loading student image
km: កំហុសក្នុងការផ្ទុករូបភាពសិស្ស

source: Smart Attendance Scanner
km: ម៉ាស៊ីនស្កេនវត្តមានឆ្លាតវៃ

# scanClassroomQRCode
source: Scan classroom QR code to record attendance
km: ស្កេនកូដ QR របស់បន្ទប់រៀនដើម្បីកត់ត្រាវត្តមាន

# systemWillCheckSchedule
source: System will automatically check your schedule and mark you as "On Time" or "Late"
km: ប្រព័ន្ធនឹងពិនិត្យកាលវិភាគរបស់អ្នកដោយស្វ័យប្រវត្តិ ហើយសម្គាល់អ្នកថា "មកទាន់ពេល" ឬ "យឺត"

source: Processing...
km: កំពុងដំណើរការ...

# pointCameraAtQR
source: Point camera at classroom QR code
km: ចង្អុលកាមេរ៉ាទៅកាន់កូដ QR របស់បន្ទប់រៀន

source: Last scanned
km: ស្កេនចុងក្រោយ

source: Processed at
km: ដំណើរការនៅពេល

# invalidQRCodeOrTeacherInfo
source: Invalid QR code or teacher information missing.
km: កូដ QR មិនត្រឹមត្រូវ ឬព័ត៌មានគ្រូបាត់។

source: Validating attendance...
km: កំពុងធ្វើការផ្ទៀងផ្ទាត់វត្តមាន...

# noSubjectScheduledNow
source: You don't have any subject scheduled right now for class
km: អ្នកមិនមានមុខវិជ្ជាកំណត់ពេលទេនៅពេលនេះសម្រាប់ថ្នាក់

source: Failed to record attendance
km: បរាជ័យក្នុងការកត់ត្រាវត្តមាន

source: Error processing QR code
km: កំហុសក្នុងការដំណើរការកូដ QR

source: Attendance Recorded
km: វត្តមានត្រូវបានកត់ត្រា

# className
source: Class:
km: ថ្នាក់:

source: Period
km: រយៈពេល

source: Status:
km: ស្ថានភាព:

source: Minutes since start:
km: នាទីចាប់តាំងពីចាប់ផ្តើម:

source: min
km: នាទី

# markedAsLate
source: Marked as late (scanned more than 20 minutes after class start)
km: សម្គាល់ថាយឺត (ស្កេនលើសពី 20 នាទីបន្ទាប់ពីចាប់ផ្តើមថ្នាក់)

# perfectTiming
source: Perfect timing! Attendance recorded on time.
km: ពេលវេលាល្អឥតខ្ចោះ! វត្តមានត្រូវបានកត់ត្រាទាន់ពេល។

source: OK
km: យល់ព្រម

source: Enrolled Students
km: សិស្សដែលបានចុះឈ្មោះ

source: Refresh List
km: ធ្វើឱ្យស្រស់បញ្ជី

source: students enrolled
km: សិស្សបានចុះឈ្មោះ

source: student enrolled
km: សិស្សបានចុះឈ្មោះ

# noCachedDataAvailable
source: No cached data available. Please refresh to fetch data.
km: មិនមានទិន្នន័យដែលបានរក្សាទុកទេ។ សូមធ្វើឱ្យស្រស់ដើម្បីទាញយកទិន្នន័យ។

source: Failed to fetch enrolled students.
km: បរាជ័យក្នុងការទាញយកសិស្សដែលបានចុះឈ្មោះ។

source: Remove Student
km: យកសិស្សចេញ

# areYouSureRemoveStudent
source: Are you sure you want to remove
km: តើអ្នកប្រាកដថាចង់យកចេញ

source: from
km: ពី

source: Remove
km: យកចេញ

# removedFromClass
source: removed from
km: ត្រូវបានយកចេញពី

source: Failed to remove student
km: បរាជ័យក្នុងការយកសិស្សចេញ

source: Retry
km: ព្យាយាមម្តងទៀត

source: No students enrolled in
km: មិនមានសិស្សចុះឈ្មោះក្នុង

# studentsCanBeEnrolledFromDashboard
source: Students can be enrolled from the main dashboard
km: សិស្សអាចត្រូវបានចុះឈ្មោះពីផ្ទាំងគ្រប់គ្រងសំខាន់

source: Student ID
km: លេខសម្គាល់សិស្ស

source: Remove from class
km: យកចេញពីថ្នាក់

source: Add Student to Class
km: បន្ថែមសិស្សទៅថ្នាក់

source: Failed to load students
km: បរាជ័យក្នុងការផ្ទុកសិស្ស

# noAvailableStudentsToAdd
source: No available students to add to this class
km: មិនមានសិស្សដែលអាចបន្ថែមទៅថ្នាក់នេះបានទេ

# selectStudentToEnroll
source: Select a student to enroll in
km: ជ្រើសរើសសិស្សម្នាក់ដើម្បីចុះឈ្មោះក្នុង

source: Search students...
km: ស្វែងរកសិស្ស...

source: available students
km: សិស្សដែលមាន

source: Unknown
km: មិនស្គាល់

source: ID
km: លេខសម្គាល់

source: Add
km: បន្ថែម

source: Enrolling Student
km: កំពុងចុះឈ្មោះសិស្ស

source: Adding
km: កំពុងបន្ថែម

source: to
km: ទៅ

# enrolledInSuccessfully
source: enrolled in
km: បានចុះឈ្មោះក្នុង

source: successfully!
km: ដោយជោគជ័យ!

source: Failed to enroll student
km: បរាជ័យក្នុងការចុះឈ្មោះសិស្ស

source: Error enrolling student
km: កំហុសក្នុងការចុះឈ្មោះសិស្ស

# attendanceTitle
source: Attendance
km: វត្តមាន

source: Refresh Student List
km: ធ្វើឱ្យស្រស់បញ្ជីសិស្ស

source: View History
km: មើលប្រវត្តិ

source: Save Attendance
km: រក្សាទុកវត្តមាន

source: Unknown Class
km: ថ្នាក់មិនស្គាល់

# dateLabel
source: Date: {date}
km: កាលបរិច្ឆេទ: {date}

# sessionLabel
source: Session:
km: វេនរៀន:

source: Morning
km: ព្រឹក

source: Afternoon
km: រសៀល

source: Present
km: មានវត្តមាន

source: Absent
km: អវត្តមាន

source: Late
km: យឺត

source: Excuse
km: សុំលេីស

# presentShort
source: P
km: ម

# absentShort
source: A
km: អ

# lateShort
source: L
km: យ

# excuseShort
source: E
km: ស

# numberShort
source: No.
km: លេខ

source: Student Name
km: ឈ្មោះសិស្ស

source: Total Absent
km: សរុបអវត្តមាន

# pleaseSelectClassToViewStudents
source: Please select a class to view students
km: សូមជ្រើសរើសថ្នាក់ដើម្បីមើលសិស្ស

# noStudentsFoundInClass
source: No students found in this class
km: រកមិនឃើញសិស្សក្នុងថ្នាក់នេះទេ

source: Submitting Attendance
km: កំពុងដាក់ស្នើវត្តមាន

source: Please wait...
km: សូមរង់ចាំ...

# savingAttendance
source: Saving attendance data...
km: កំពុងរក្សាទុកទិន្នន័យវត្តមាន...

source: Attendance saved successfully!
km: រក្សាទុកវត្តមានបានជោគជ័យ!

source: new records created.
km: កំណត់ត្រាថ្មីត្រូវបានបង្កើត។

source: records updated.
km: កំណត់ត្រាត្រូវបានធ្វើបច្ចុប្បន្នភាព។

# attendanceSavedWithErrors
source: Attendance saved with some errors.
km: រក្សាទុកវត្តមានដោយមានកំហុសខ្លះ។

source: saved,
km: បានរក្សាទុក,

source: updated,
km: បានធ្វើបច្ចុប្បន្នភាព,

source: errors.
km: កំហុស។

source: Check console for details.
km: ពិនិត្យ console សម្រាប់ព័ត៌មានលម្អិត។

source: Details
km: ព័ត៌មានលម្អិត

source: Error Details
km: ព័ត៌មានលម្អិតកំហុស

# errorsWhileSaving
source: There were {count} errors while saving attendance.
km: មានកំហុស {count} នៅពេលរក្សាទុកវត្តមាន។

# errorReasons
source: This could be due to: • Network connectivity issues • Missing student data • Database permission issues • Invalid student IDs Check the console logs for detailed error messages.
km: នេះអាចបណ្តាលមកពី: • បញ្ហាការតភ្ជាប់បណ្តាញ • ទិន្នន័យសិស្សបាត់បង់ • បញ្ហាសិទ្ធិគ្រប់គ្រងមូលដ្ឋានទិន្នន័យ • លេខសម្គាល់សិស្សមិនត្រឹមត្រូវ ពិនិត្យកំណត់ហេតុ console សម្រាប់សារកំហុសលម្អិត។

# errorSavingAttendance
source: Error saving attendance: {error}
km: កំហុសក្នុងការរក្សាទុកវត្តមាន: {error}

# navigationError
source: Navigation error: {error}
km: កំហុសការរុករក: {error}

source: Attendance History
km: ប្រវត្តិវត្តមាន

source: No class selected.
km: មិនបានជ្រើសរើសថ្នាក់ទេ។

source: No attendance records.
km: មិនមានកំណត់ត្រាវត្តមានទេ។

# statusDateSession
source: Status: {status}, Date: {date}, Session: {session}
km: ស្ថានភាព: {status}, កាលបរិច្ឆេទ: {date}, វេនរៀន: {session}

source: Admin: All QR Attendance
km: អ្នកគ្រប់គ្រង: វត្តមាន QR ទាំងអស់

source: Total Scans
km: ស្កេនសរុប

source: On Time
km: ទាន់ពេល

source: Filter by Teacher
km: ច្រាសតាមគ្រូ

source: All Teachers
km: គ្រូទាំងអស់

source: Today
km: ថ្ងៃនេះ

source: Week
km: សប្តាហ៍

source: Month
km: ខែ

source: All
km: ទាំងអស់

# dateColon
source: Date:
km: កាលបរិច្ឆេទ:

# errorLoadingAttendanceRecords
source: Error loading attendance records: {error}
km: កំហុសក្នុងការផ្ទុកកំណត់ត្រាវត្តមាន: {error}

source: No QR attendance records found
km: រកមិនឃើញកំណត់ត្រាវត្តមាន QR ទេ

# noRecordsForSelectedTeacher
source: No records for {teacherName}
km: មិនមានកំណត់ត្រាសម្រាប់ {teacherName}

# noTeachersScannedQR
source: No teachers have scanned QR codes yet
km: មិនទាន់មានគ្រូម្នាក់ណាស្កេនកូដ QR ទេ

source: Unknown Teacher
km: គ្រូមិនស្គាល់

source: General Class
km: ថ្នាក់ទូទៅ

source: Class Time:
km: ពេលវេលាថ្នាក់:

source: Scanned At:
km: ស្កេននៅពេល:

source: Delay:
km: ការពន្យារពេល:

# minutesLate
source: {minutes} minutes late
km: យឺត {minutes} នាទី

source: Edit Student
km: កែប្រែសិស្ស

source: Student Photo
km: រូបថតសិស្ស

source: Tap to change photo
km: ចុចដើម្បីផ្លាស់ប្តូររូបថត

source: Student Information
km: ព័ត៌មានសិស្ស

source: Student updated successfully!
km: ធ្វើបច្ចុប្បន្នភាពសិស្សបានជោគជ័យ!

source: Update Student
km: ធ្វើបច្ចុប្បន្នភាពសិស្ស

source: Failed to update student
km: បរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពសិស្ស

source: Select Date
km: ជ្រើសរើសកាលបរិច្ឆេទ

source: Morning Class
km: ថ្នាក់ព្រឹក

source: Evening Class
km: ថ្នាក់ល្ងាច

# selectMorningClass
source: Select Morning Class (Optional)
km: ជ្រើសរើសថ្នាក់ព្រឹក (ស្រេចចិត្ត)

# selectEveningClass
source: Select Evening Class (Optional)
km: ជ្រើសរើសថ្នាក់ល្ងាច (ស្រេចចិត្ត)
